; domain
(define (domain board-a-small-boat)
  (:requirements :strips :typing)

  (:types
    passenger platform dock boat - object
  )

  (:predicates
    ;;       ：
    (at ?obj - object ?place - object)

    ;;
    (holding-rail ?p - passenger)

    ;;
    (legs-in-boat ?p - passenger)

    ;;
    (centered ?b - boat)

    ;;
    (crouched ?p - passenger)

    ;;
    (boat-stable ?b - boat)

    ;;
    (platform-present ?pl - platform)

    ;;
    (boat-at-dock ?b - boat)

    ;;
    (boat-moving ?b - boat)
  )

  ;;   1：
  (:action board_via_platform
    :parameters (?p - passenger ?pl - platform ?b - boat ?d - dock)
    :precondition (and
                    (platform-present ?pl)
                    (at ?p ?pl)
                    (at ?pl ?d)
                    (at ?b ?d))
    :effect (and
              (at ?p ?b)
              (not (at ?p ?pl))
             )
  )

  ;;   2：
  (:action hold_rails
    :parameters (?p - passenger ?b - boat)
    :precondition (at ?p ?b)
    :effect (holding-rail ?p)
  )

  ;;   3：
  (:action secure_legs
    :parameters (?p - passenger ?b - boat)
    :precondition (at ?p ?b)
    :effect (legs-in-boat ?p)
  )

  ;;   4：
  (:action stabilize_boat
    :parameters (?p - passenger ?b - boat)
    :precondition (and
                    (legs-in-boat ?p)
                    (holding-rail ?p)
                    (at ?p ?b))
    :effect (and
              (centered ?b)
              (crouched ?p)
              (boat-stable ?b)
             )
  )

  ;;   5：
  (:action others_keep_boat_steady
    :parameters (?op - passenger ?b - boat)
    :precondition (boat-stable ?b)
    :effect (at ?op ?b)
  )

)

; problem
(define (problem board-a-small-boat-problem)
  (:domain board-a-small-boat)

  (:objects
    passenger1 passenger2 - passenger
    platform1 - platform
    dock1 - dock
    boat1 - boat
  )

  (:init
    ;;
    (at passenger1 platform1)
    (at platform1 dock1)
    (at boat1 dock1)

    ;;
    (platform-present platform1)

    ;;
    (not (holding-rail passenger1))
    (not (legs-in-boat passenger1))
    (not (centered boat1))
    (not (crouched passenger1))
    (not (boat-stable boat1))
    (not (boat-moving boat1))

    ;;   2
    (not (at passenger2 boat1))
  )

  (:goal
    (and
      ;;   1
      (at passenger1 boat1)

      ;;
      (legs-in-boat passenger1)

      ;;
      (holding-rail passenger1)

      ;;
      (centered boat1)
      (boat-stable boat1)

      ;;   1
      (crouched passenger1)
    )
  )
)

; plan
1. (board_via_platform passenger1 platform1 boat1 dock1)
   deleted: (at passenger1 platform1)
   added: (at passenger1 boat1)
   goals met: 1 of 6
2. (hold_rails passenger1 boat1)
   added: (holding-rail passenger1)
   goals met: 2 of 6
3. (secure_legs passenger1 boat1)
   added: (legs-in-boat passenger1)
   goals met: 3 of 6
4. (stabilize_boat passenger1 boat1)
   added: (centered boat1) (crouched passenger1) (boat-stable boat1)
   goals met: 6 of 6
